OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f97j60.h
extern __at(0x0EFE) volatile __ECON2bits_t ECON2bits;

#define _ETHEN                  0x20
#define _PKTDEC                 0x40
#define _AUTOINC                0x80

//==============================================================================


//==============================================================================
//        EIR Bits

extern __at(0x0F60) __sfr EIR;

typedef struct
  {
  unsigned RXERIF               : 1;
  unsigned TXERIF               : 1;
  unsigned                      : 1;
  unsigned TXIF                 : 1;
  unsigned LINKIF               : 1;
  unsigned DMAIF                : 1;
  unsigned PKTIF                : 1;
  unsigned                      : 1;
  } __EIRbits_t;

extern __at(0x0F60) volatile __EIRbits_t EIRbits;

#define _RXERIF                 0x01
#define _TXERIF                 0x02
#define _TXIF                   0x08
#define _LINKIF                 0x10
#define _DMAIF                  0x20
#define _PKTIF                  0x40

//==============================================================================


//==============================================================================
//        EDATA Bits

extern __at(0x0F61) __sfr EDATA;

typedef struct
  {
  unsigned EDATA0               : 1;
  unsigned EDATA1               : 1;
  unsigned EDATA2               : 1;
  unsigned EDATA3               : 1;
  unsigned EDATA4               : 1;
  unsigned EDATA5               : 1;
  unsigned EDATA6               : 1;
  unsigned EDATA7               : 1;
  } __EDATAbits_t;

extern __at(0x0F61) volatile __EDATAbits_t EDATAbits;

#define _EDATA0                 0x01
#define _EDATA1                 0x02
#define _EDATA2                 0x04
#define _EDATA3                 0x08
#define _EDATA4                 0x10
#define _EDATA5                 0x20
#define _EDATA6                 0x40
#define _EDATA7                 0x80

//==============================================================================


//==============================================================================
//        SSP2CON2 Bits

extern __at(0x0F62) __sfr SSP2CON2;

typedef union
  {
  struct
    {
    unsigned SEN                : 1;
    unsigned RSEN               : 1;
    unsigned PEN                : 1;
    unsigned RCEN               : 1;
    unsigned ACKEN              : 1;
    unsigned ACKDT              : 1;
    unsigned ACKSTAT            : 1;
    unsigned GCEN               : 1;
    };

  struct
    {
    unsigned SEN2               : 1;
    unsigned ADMSK1             : 1;
    unsigned ADMSK2             : 1;
    unsigned ADMSK3             : 1;
    unsigned ADMSK4             : 1;
    unsigned ADMSK5             : 1;
    unsigned ACKSTAT2           : 1;
    unsigned GCEN2              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned RSEN2              : 1;
    unsigned PEN2               : 1;
    unsigned RCEN2              : 1;
    unsigned ACKEN2             : 1;
    unsigned ACKDT2             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned ADMSK12            : 1;
    unsigned ADMSK22            : 1;
    unsigned ADMSK32            : 1;
    unsigned ADMSK42            : 1;
    unsigned ADMSK52            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __SSP2CON2bits_t;

extern __at(0x0F62) volatile __SSP2CON2bits_t SSP2CON2bits;

#define _SSP2CON2_SEN           0x01
#define _SSP2CON2_SEN2          0x01
#define _SSP2CON2_RSEN          0x02
#define _SSP2CON2_ADMSK1        0x02
#define _SSP2CON2_RSEN2         0x02
#define _SSP2CON2_ADMSK12       0x02
#define _SSP2CON2_PEN           0x04
#define _SSP2CON2_ADMSK2        0x04
#define _SSP2CON2_PEN2          0x04
#define _SSP2CON2_ADMSK22       0x04
#define _SSP2CON2_RCEN          0x08
#define _SSP2CON2_ADMSK3        0x08
#define _SSP2CON2_RCEN2         0x08
#define _SSP2CON2_ADMSK32       0x08
#define _SSP2CON2_ACKEN         0x10
#define _SSP2CON2_ADMSK4        0x10
#define _SSP2CON2_ACKEN2        0x10
#define _SSP2CON2_ADMSK42       0x10
#define _SSP2CON2_ACKDT         0x20
#define _SSP2CON2_ADMSK5        0x20
#define _SSP2CON2_ACKDT2        0x20
#define _SSP2CON2_ADMSK52       0x20
#define _SSP2CON2_ACKSTAT       0x40
#define _SSP2CON2_ACKSTAT2      0x40
#define _SSP2CON2_GCEN          0x80
#define _SSP2CON2_GCEN2         0x80

//==============================================================================


//==============================================================================
//        SSP2CON1 Bits

extern __at(0x0F63) __sfr SSP2CON1;

typedef union
  {
  struct
    {
    unsigned SSPM0              : 1;
    unsigned SSPM1              : 1;
    unsigned SSPM2              : 1;
    unsigned SSPM3              : 1;
    unsigned CKP                : 1;
    unsigned SSPEN              : 1;
    unsigned SSPOV              : 1;
    unsigned WCOL               : 1;
    };

  struct
    {
    unsigned SSPM02             : 1;
    unsigned SSPM12             : 1;
    unsigned SSPM22             : 1;
    unsigned SSPM32             : 1;
    unsigned CKP2               : 1;
    unsigned SSPEN2             : 1;
    unsigned SSPOV2             : 1;
    unsigned WCOL2              : 1;
    };
  } __SSP2CON1bits_t;

extern __at(0x0F63) volatile __SSP2CON1bits_t SSP2CON1bits;

#define _SSP2CON1_SSPM0         0x01
#define _SSP2CON1_SSPM02        0x01
#define _SSP2CON1_SSPM1         0x02
#define _SSP2CON1_SSPM12        0x02
#define _SSP2CON1_SSPM2         0x04
#define _SSP2CON1_SSPM22        0x04
#define _SSP2CON1_SSPM3         0x08
#define _SSP2CON1_SSPM32        0x08
#define _SSP2CON1_CKP           0x10
#define _SSP2CON1_CKP2          0x10
#define _SSP2CON1_SSPEN         0x20
#define _SSP2CON1_SSPEN2        0x20
#define _SSP2CON1_SSPOV         0x40
#define _SSP2CON1_SSPOV2        0x40
#define _SSP2CON1_WCOL          0x80
#define _SSP2CON1_WCOL2         0x80

//==============================================================================


//==============================================================================
//        SSP2STAT Bits

