OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f97j60.h
extern __at(0x0F64) __sfr SSP2STAT;

typedef union
  {
  struct
    {
    unsigned BF                 : 1;
    unsigned UA                 : 1;
    unsigned R_NOT_W            : 1;
    unsigned S                  : 1;
    unsigned P                  : 1;
    unsigned D_NOT_A            : 1;
    unsigned CKE                : 1;
    unsigned SMP                : 1;
    };

  struct
    {
    unsigned BF2                : 1;
    unsigned UA2                : 1;
    unsigned R_W                : 1;
    unsigned I2C_START          : 1;
    unsigned I2C_STOP           : 1;
    unsigned D_A                : 1;
    unsigned CKE2               : 1;
    unsigned SMP2               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned I2C_READ           : 1;
    unsigned START2             : 1;
    unsigned STOP2              : 1;
    unsigned I2C_DAT            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_W              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_A              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_WRITE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_ADDRESS        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned READ_WRITE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA_ADDRESS       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned R                  : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned D                  : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RW2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DA2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __SSP2STATbits_t;

extern __at(0x0F64) volatile __SSP2STATbits_t SSP2STATbits;

#define _SSP2STAT_BF            0x01
#define _SSP2STAT_BF2           0x01
#define _SSP2STAT_UA            0x02
#define _SSP2STAT_UA2           0x02
#define _SSP2STAT_R_NOT_W       0x04
#define _SSP2STAT_R_W           0x04
#define _SSP2STAT_I2C_READ      0x04
#define _SSP2STAT_NOT_W         0x04
#define _SSP2STAT_NOT_WRITE     0x04
#define _SSP2STAT_READ_WRITE    0x04
#define _SSP2STAT_R             0x04
#define _SSP2STAT_RW2           0x04
#define _SSP2STAT_S             0x08
#define _SSP2STAT_I2C_START     0x08
#define _SSP2STAT_START2        0x08
#define _SSP2STAT_P             0x10
#define _SSP2STAT_I2C_STOP      0x10
#define _SSP2STAT_STOP2         0x10
#define _SSP2STAT_D_NOT_A       0x20
#define _SSP2STAT_D_A           0x20
#define _SSP2STAT_I2C_DAT       0x20
#define _SSP2STAT_NOT_A         0x20
#define _SSP2STAT_NOT_ADDRESS   0x20
#define _SSP2STAT_DATA_ADDRESS  0x20
#define _SSP2STAT_D             0x20
#define _SSP2STAT_DA2           0x20
#define _SSP2STAT_CKE           0x40
#define _SSP2STAT_CKE2          0x40
#define _SSP2STAT_SMP           0x80
#define _SSP2STAT_SMP2          0x80

//==============================================================================

extern __at(0x0F65) __sfr SSP2ADD;
extern __at(0x0F66) __sfr SSP2BUF;

//==============================================================================
//        ECCP2DEL Bits

extern __at(0x0F67) __sfr ECCP2DEL;

typedef union
  {
  struct
    {
    unsigned PDC0               : 1;
    unsigned PDC1               : 1;
    unsigned PDC2               : 1;
    unsigned PDC3               : 1;
    unsigned PDC4               : 1;
    unsigned PDC5               : 1;
    unsigned PDC6               : 1;
    unsigned PRSEN              : 1;
    };

  struct
    {
    unsigned P2DC0              : 1;
    unsigned P2DC1              : 1;
    unsigned P2DC2              : 1;
    unsigned P2DC3              : 1;
    unsigned P2DC4              : 1;
    unsigned P2DC5              : 1;
    unsigned P2DC6              : 1;
    unsigned P2RSEN             : 1;
    };

  struct
    {
    unsigned PDC                : 7;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2DC               : 7;
    unsigned                    : 1;
    };
  } __ECCP2DELbits_t;

extern __at(0x0F67) volatile __ECCP2DELbits_t ECCP2DELbits;

#define _ECCP2DEL_PDC0          0x01
#define _ECCP2DEL_P2DC0         0x01
#define _ECCP2DEL_PDC1          0x02
#define _ECCP2DEL_P2DC1         0x02
#define _ECCP2DEL_PDC2          0x04
#define _ECCP2DEL_P2DC2         0x04
#define _ECCP2DEL_PDC3          0x08
#define _ECCP2DEL_P2DC3         0x08
#define _ECCP2DEL_PDC4          0x10
#define _ECCP2DEL_P2DC4         0x10
#define _ECCP2DEL_PDC5          0x20
#define _ECCP2DEL_P2DC5         0x20
#define _ECCP2DEL_PDC6          0x40
#define _ECCP2DEL_P2DC6         0x40
#define _ECCP2DEL_PRSEN         0x80
#define _ECCP2DEL_P2RSEN        0x80

//==============================================================================


//==============================================================================
//        ECCP2AS Bits

extern __at(0x0F68) __sfr ECCP2AS;

typedef union
  {
  struct
    {
    unsigned PSSBD0             : 1;
    unsigned PSSBD1             : 1;
    unsigned PSSAC0             : 1;
    unsigned PSSAC1             : 1;
    unsigned ECCPAS0            : 1;
    unsigned ECCPAS1            : 1;
    unsigned ECCPAS2            : 1;
    unsigned ECCPASE            : 1;
    };

  struct
    {
    unsigned PSS2BD0            : 1;
    unsigned PSS2BD1            : 1;
    unsigned PSS2AC0            : 1;
    unsigned PSS2AC1            : 1;
    unsigned ECCP2AS0           : 1;
    unsigned ECCP2AS1           : 1;
    unsigned ECCP2AS2           : 1;
    unsigned ECCP2ASE           : 1;
    };

  struct
    {
    unsigned PSSBD              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PSS2BD             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSSAC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS2AC             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP2AS            : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCPAS             : 3;
    unsigned                    : 1;
    };
  } __ECCP2ASbits_t;

extern __at(0x0F68) volatile __ECCP2ASbits_t ECCP2ASbits;

#define _ECCP2AS_PSSBD0         0x01
#define _ECCP2AS_PSS2BD0        0x01
#define _ECCP2AS_PSSBD1         0x02
#define _ECCP2AS_PSS2BD1        0x02
#define _ECCP2AS_PSSAC0         0x04
#define _ECCP2AS_PSS2AC0        0x04
#define _ECCP2AS_PSSAC1         0x08
#define _ECCP2AS_PSS2AC1        0x08
#define _ECCP2AS_ECCPAS0        0x10
#define _ECCP2AS_ECCP2AS0       0x10
#define _ECCP2AS_ECCPAS1        0x20
#define _ECCP2AS_ECCP2AS1       0x20
#define _ECCP2AS_ECCPAS2        0x40
#define _ECCP2AS_ECCP2AS2       0x40
#define _ECCP2AS_ECCPASE        0x80
#define _ECCP2AS_ECCP2ASE       0x80

//==============================================================================


//==============================================================================
//        ECCP3DEL Bits

extern __at(0x0F69) __sfr ECCP3DEL;

typedef union
  {
  struct
    {
    unsigned PDC0               : 1;
    unsigned PDC1               : 1;
    unsigned PDC2               : 1;
    unsigned PDC3               : 1;
    unsigned PDC4               : 1;
    unsigned PDC5               : 1;
    unsigned PDC6               : 1;
    unsigned PRSEN              : 1;
    };

  struct
    {
    unsigned P3DC0              : 1;
    unsigned P3DC1              : 1;
    unsigned P3DC2              : 1;
    unsigned P3DC3              : 1;
    unsigned P3DC4              : 1;
    unsigned P3DC5              : 1;
    unsigned P3DC6              : 1;
    unsigned P3RSEN             : 1;
    };

  struct
    {
    unsigned PDC                : 7;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3DC               : 7;
    unsigned                    : 1;
    };
  } __ECCP3DELbits_t;

extern __at(0x0F69) volatile __ECCP3DELbits_t ECCP3DELbits;

#define _ECCP3DEL_PDC0          0x01
#define _ECCP3DEL_P3DC0         0x01
#define _ECCP3DEL_PDC1          0x02
#define _ECCP3DEL_P3DC1         0x02
#define _ECCP3DEL_PDC2          0x04
#define _ECCP3DEL_P3DC2         0x04
#define _ECCP3DEL_PDC3          0x08
#define _ECCP3DEL_P3DC3         0x08
#define _ECCP3DEL_PDC4          0x10
#define _ECCP3DEL_P3DC4         0x10
#define _ECCP3DEL_PDC5          0x20
#define _ECCP3DEL_P3DC5         0x20
#define _ECCP3DEL_PDC6          0x40
#define _ECCP3DEL_P3DC6         0x40
#define _ECCP3DEL_PRSEN         0x80
#define _ECCP3DEL_P3RSEN        0x80

//==============================================================================


//==============================================================================
//        ECCP3AS Bits

extern __at(0x0F6A) __sfr ECCP3AS;

typedef union
  {
  struct
    {
    unsigned PSSBD0             : 1;
    unsigned PSSBD1             : 1;
    unsigned PSSAC0             : 1;
    unsigned PSSAC1             : 1;
    unsigned ECCPAS0            : 1;
    unsigned ECCPAS1            : 1;
    unsigned ECCPAS2            : 1;
    unsigned ECCPASE            : 1;
    };

  struct
    {
    unsigned PSS3BD0            : 1;
    unsigned PSS3BD1            : 1;
    unsigned PSS3AC0            : 1;
    unsigned PSS3AC1            : 1;
    unsigned ECCP3AS0           : 1;
    unsigned ECCP3AS1           : 1;
    unsigned ECCP3AS2           : 1;
    unsigned ECCP3ASE           : 1;
    };

  struct
    {
    unsigned PSSBD              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PSS3BD             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSSAC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS3AC             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP3AS            : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCPAS             : 3;
    unsigned                    : 1;
    };
  } __ECCP3ASbits_t;

